ci4/app/Controllers/Heresy.php

INSERT INTO `heresy` (`name`, `email`, `alias`, `title`, `caption`, `image`) VALUES ('Elias Shaw', '', 'Dr Bright', 'Image', 'Wait, I thought we could upload *any* image?', 'https://lh3.googleusercontent.com/d/18hLGNexUwZ0RD1_NtH24wtloI8i9dLjO=w1200')
---
	public function create()
    {
        helper('form');

        $data = $this->request->getPost(['name', 'email', 'alias', 'title', 'caption', 'image']);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data, [
			'name' => 'required|max_length[75]|alpha_numeric_space',
			'email' => 'permit_empty|max_length[70]|valid_email',
			'alias' => 'permit_empty|max_length[40]|alpha_numeric_space',
            'title' => 'required|max_length[120]|min_length[3]',
            'caption'  => 'permit_empty|max_length[120]|min_length[3]',
			'image' => 'required|max_length[512]|valid_url_strict',
        ])) {
            // The validation fails, so returns the form.
            return $this->upload();
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model = model(HeresyModel::class);

        $model->save([
			'name' => $post['name'],
			'email' => $post['email'],
            'alias' => $post['alias'],
			'title' => $post['title'],
			'caption' => $post['caption'],
			'image' => $post['image'],
        ]);