ci4/app/Controllers/News.php

INSERT INTO `news` (`title`, `slug`, `body`) VALUES ('New ULTRAKILL teaser shocks veterans!', 'new-ultrakill-teaser-shocks-veterans', 'The new ULTRAKILL preview includes a new alternative weapon: a flamethrower! Maybe those Streetcleaners can get a taste of revenge this time?')
---
	public function create()
    {
        helper('form');

        $data = $this->request->getPost(['title', 'body']);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data, [
            'title' => 'required|max_length[256]|min_length[3]',
            'body'  => 'required|max_length[5000]|min_length[3]',
        ])) {
            // The validation fails, so returns the form.
            return $this->new();
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model = model(NewsModel::class);

        $model->save([
            'title' => $post['title'],
            'slug'  => url_title($post['title'], '-', true),
            'body'  => $post['body'],
        ]);